# 표본공간(sample space)
- 통계적 실험이나 조사에서 일어날 수 있는 모든 가능한 결과의 모임
- 대개 S로 표시

# 사건(또는 사상, event)
- 일어날 수 있는 모든 가능한 결과 중에서 특정한 성질을 갖는 결과의 모임
- 대개 A,B,C .. 등으로 표시

# 동전을 한 번 던지는 실험
- 원소 : H (=앞면) 또는 T(=뒷면)
- 표본공간 : S = {H,T}

# 주사위를 한 번 던지는 실험
- 원소 : 1,2,3,4,5,6
- 표본공간 : S = {1,2,3,4,5,6}
- 사상 : 실험의 결과 짝수 눈이 나오는 경우
    - A = {2,4,6}

# 확률실험 사례1
1. 생산품을 품질검사 하는 경우
- 표본공간
    S = {정상품, 불량품}
- 한 개 제품을 검사할 때 불량품일 사건
    A = {불량품}

# 확률실험 사례2
2. 피자 배달의 예
표본공간 S = {t:t > 0}
배달시간이 20분 이내일 사건 A = {t: 0 < t < 20}

# 확률의 고전적 정의
- 표본공간 내 모든 원소의 발생 가능성이 같은 경우
    - 이산형 표본공간의 경우
    - P(A) = 사건 A에 속하는 원소의 개수/표본공간의 전체 원소의 개수

- 연속형 표본공간의 경우
    - P(A) = 사건 A에 속하는 원소에 대한 측도/표본공간의 전체 원소에 대한 측도

# (사례1) 주사위를 던지는 실험
- 표본공간 : S = {1,2,3,4,5,6}
- 홀수가 나올 확률은?

- 풀이
    - 홀수가 나올 사건 A = {1,3,5}
    - 표본공간 내 모든 원소의 발생 가능성이 같은가?
    - P(A) = 3/6 = 1/2 = 0.5

# (사례2) 피자 배달시간의 예
- 표본공간 : S = {(10, 30)}
    - "배달 시간은 10분에서 30분까지 같은 가능성"
- 20분에서 25분 사이에 배달되는 사건 : B = {(20,25)}
- 배달시간이 20분에서 25분 사이일 확률
- P(B) = 5/20 = 1/4